faqElements = document.getElementsByClassName("faq-element");
faqElementsArray = [].slice.call(faqElements);

faqElementsArray.forEach(e => {
    question = e.getElementsByClassName("faq-question")[0];
    text = e.getElementsByClassName("faq-text")[0];
    text.setAttribute("dir", "ltr");
    e.style.maxHeight = question.offsetHeight + "px";
    e.onclick = () => {
        question = e.getElementsByClassName("faq-question")[0];
        text = e.getElementsByClassName("faq-text")[0];
        if (!e.classList.contains("open")) {
            e.classList.add("open");
            console.log(height);
            e.style.maxHeight =  "1000px";
        } else {
            e.classList.remove("open");
            e.style.maxHeight = question.offsetHeight + "px";
        }
    };
});

var arabicContent = [
    {
        question: "ماهي أعراض مرض كوفيد-19 ؟\t",
        answer: "تتمثّل الأعراض الأكثر شيوعا عادة في السّعال ، الحمى ، آلام عضلية ، ضيق في التنفس .ناهيك عن أعراض خصوصية أخرى تم ملاحظتها تتمثل في فقدان حاسة الشّم دون انسداد الأنف: فقدان أو اضطراب حاسة التذوّق ... (المصدر : منظمة الصحة العالمية)\n" +
            "تم وصف أعراض أخرى أكثر خطورة في هذا السياق ( 16 الى 32% ) والتي تُعرف بشكل رئيسي عند كبار السن والمرضى الذين يعانون من نقص المناعة والأمراض المزمنة مثل مرض السكري وارتفاع ضغط الدّم  ، والسرطان وأمراض الجهاز التنفسي المزمنة   مثل الالتهاب الرئوي أو متلازمة الضّائقة التّنفسية الحادّة (Zhu N, Song Z, Lu R,2019)."
    }, {
        question: "كيف ينتشر فيروس كورونا\t",
        answer: "بوابة دخول الفيروس\n" +
            "يمكن أن يصاب الأشخاص بمرض كوفيد-19 عن طريق التّواصل مع  شخص آخر مصاب بالفيروس. ويمكن للمرض أن ينتقل بين الأشخاص:  \n" +
            "-عن طريق قطرات منبعثة أثناء السّعال أو العطس، حيث يرتفع خطر انتقال العدوى بارتفاع كمية الفيروس المنبعثة .\n" +
            "-عن طريق ملامسة الأيدي  لأسطح ملوثة بالفيروس  ثم العيون الأنف و الفم .\n" + "احتمال انتقال الفيروس عن طريق شخص عديم الأعراض ضعيف جدّا , لكن امكانية التقاط المرض من طرف شخص مصاب ذو أعراض خفيفة هي واردة وينطبق ذلك بصفة خاصة على المراحل المبكرة للمرض.\n"
            + " إنّ مخاطر انتقال العدوى عن طريق البراز من شخص مصاب ممكنة وذلك لأن البراز يعتبر احد مسارات  التخلص من الفيروس إلاّ أنّ  البحوث الجارية تبيّن أن نسبة انتقال المرض عبر البراز جدّ ضعيفة (WANG 2020)"
            + "لم يتم تسجيل أي حالة انتقال العدوى عبر المشيمة. (Huijun Chen 2019 )",
    },{
        question: "هل فيروس كورونا يتنشر عبر الهواء ؟",
        answer: "نعم، يمكن للفيروس الانتقال عبر الهواء عن طريق (قطرات صغيرة يقلّ قطرها عن 5 ميكرومتر وتحتوي على فيروس متبقّي في الهواء لفترات طويلة) ولكن خطر انتقال العدوى منخفض جدّا (van dromelan et al )",
    },{
        question: "كم يمكن لفيروس كورونا أن يعيش على الأسطح؟",
        answer: "يمكن للفيروس أن يعيش على شكل آثار من عدّة ساعات إلى عدة أيّام على الأسطح لكن تواجد عدد قليل من الفيروسات لا يعني أنه كاف لإصابة  الشخص بعد لمسه للسطح الملوث. " +
            "في الواقع بعد بضع ساعات تموت أغلبية الفيروسات فيصبح العدد القليل المتبقي  غير قادر على إحداث العدوى. إنّ القدرة الهائلة في الانتشار التي يتميز بها الفيروس لا تعود أساسا الى طول المدة التي يعيش فيها على الأ سطح و إنّما إلى  كمية الشحنة الفيروسية المتواجدة. ولذلك يوجب احترام مسافة الأمان الوقائية بين الأشخاص." +
            ""
    },{
        question: "هل يمكن للبعّوض أن ينقل فيروس كورونا؟\t",
        answer: "\"إلى غاية الآن لا يوجد أي دليل على انتقال الفيروس عن طريق البعّوض.  مرض كوفيد-19 ليس بمرض ناقل ( ينتقل إلى البشر عبر لسعات الحشرات) فهو ينتقل بين البشر في المقام الأوّل عن طريق القطرات المنبعثة من الفم أو الإفرازات الأنفية.\n" +
            "\n" +
            "\""
    },{
        question: "هل يمكن انتقال فيروس كورونا عن طريق الماء و الأطعمة\t",
        answer: "حتى الآن ، لم يتم إثبات إمكانية انتقال فيروس كورونا عن طريق المياه أو الأغذية النيّئة أو غير المطبوخة جيدًا ، فإنها لا تشكل أي خطر لانتقال الفيروس ، شريطة مراعاة القواعد الصحية الجيدة المعتادة أثناء التعامل مع المواد الغذائية وإعدادها. (الوكالة الوطنية للأمن الغذائي والبيئي والصحة المهنية ANSES)"
    },{
        question: "هل هناك مخاطر مرتبطة بالحيوانات الأليفة والماشية ؟\t",
        answer: "لا يوجد دليل على أن الحيوانات الأليفة تلعب دورًا في انتشار فيروس كورونا. بالإضافة إلى ذلك، يبدو أن انتقال الفيروس المسبب لمرض كوفيد-19 من البشر إلى أنواع حيوانية أخرى غير مرجح (الوكالة الوطنية للأمن الغذائي والبيئي والصحي المهني ANSES )."
    },{
        question: "ما هي فترة الحضانة لمرض كوفيد-19؟\t",
        answer: "تتراوح فترة حضانة فيروس كورونا  المسؤول على مرض COVID-19 من 3 إلى 5 أيام بشكل عام، ويمكن أن تصل إلى 14 يومًا." + " خلال هذه الفترة، يمكن أن يكون الشخص معديًا، أي يمكنه حمل الفيروس قبل ظهور الأعراض أو أي علامات ضعيفة (OMSمنظمة الصحة العالمية    -Lauer et al. 2020 Ganyani, Nishiura ),  "
    },{
        question: "ما مدى احتمالية الإصابة بمرض كوفيد-19؟\t",
        answer: "إنّ الخطر يعتمد على الموقع، وبشكل أكثر تحديدًا، على انتشار المرض في منطقة معينة أم لا."
    },{
        question: "هل سيختفي فيروس كورونا  هذا الصيف (تأثير موسمي)؟\t",
        answer: "من المستحيل التّكهن، بالنظر إلى عدد الإصابات المسّجلة في دول الشرق الأوسط، فقد لا يكون لدرجة الحرارة تأثير على الفيروس . " + "من الصعب في الوقت الحالي استخلاص استنتاجات راسخة حول حركة فيروس كورونا نظرًا لتزايد الحالات يومًا بعد يوم في جميع أنحاء العالم. فلا حاجة إلى النّظر في البلدان الأكثر تأثرًا في الوقت الحالي، والإعتماد على درجة حرارتها لمحاولة استنتاج درجات الحرارة الملائمة لانتشار الفيروس. " + "ترتبط موسمية الفيروس بقرب الأشخاص بشكل أكبر خلال فصل الشتاء مقارنة بالصيف."
    },{
        question: "هل مرض كوفيد-19 خفيف؟\t",
        answer: "يعتبر كوفيد-19  مرضا خفيفًا بشكل عام، خاصة عند الأطفال والشّباب، وقد يكون أحيانا خطيرًا: 1 من كل 5 مرضى يجب إدخاله إلى المستشفى. لذلك من الطبيعي أن تقلق بشأن عواقب تفشي المرض على نفسك وعلى أحبائك." + " من الممكن تهدئة مخاوفك و توجيه قلقك إلى النّحو الصحيح  عن طريق اتخاذ خطوات لحماية نفسك وأحبائك ومجتمعك. أولاً، يجب أن تغسل يديك بانتظام وبشكل كامل واتباع قواعد النظافة التنفسية. ثانياً، مواكبة الوضع واتباع نصيحة السلطات  الصحية المحلية، واحترام الحجر المنزلي  "
    },{
        question: "من المعرّض لخطر الإصابة بشكل خطير من مرض كوفيد-19؟\t",
        answer: "استنادًا إلى المعرفة الحالية بكيفية تأثير فيروس كورونا  على الأفراد، فإنّ كبار السن والمصابين بأمراض مصاحبة (ارتفاع ضغط الدم، أمراض الرئة، السرطان، السكري أو أمراض القلب) يشكلون الفئة المعرضة لخطر الإصابة بأشكال حادة وشديدة من مرض كوفيد-19 (منظمة الصحة العالميةOMS )."
    },{
        question: "هل النساء الحوامل في خطر الإصابة بكوفيد-19؟\t",
        answer: "تندرج النساء الحوامل ضمن الفئة الضعيفة التي تتطلب اهتماما كبيرا. ومع ذلك، فإن المعلومات الأولية حول تأثير فيروس كورونا  على النساء الحوامل والجنين مطمئنة. ومع ذلك، كإجراء وقائي، تعتبر النساءالحوامل في الفصل الثالث في خطر. (الهيئة الصحية العليا بفرنسا)"
    },{
        question: "من هو الشخص الذي يعتبر معرض لخطر الإصابة بمرض كوفيد-19؟\t",
        answer: "\"من هو الشّخص الذي يعتبر معرض للخطر؟\n" +
            " الأشخاص الذين تبلغ أعمارهم 70 عاماً فما فوق.\n" +
            " المرضى الذين يعانون من أمراض الكلى المزمنة وغسل الكلى، قصور القلب مرحلة III أو IV.\n" +
            " المرضى الذين لديهم أمراض القلب والأوعية الدّموية: ارتفاع ضغط الدم المعقد، حوادث وعائية دماغية سابقة، أمراض الشريان التّاجي، جراحة القلب أو قصور القلب مرحلة III أو IV.\n" +
            " مرضى السُّكري المعتمدون على الأنسولين الذين يعانون من عدم التوازن أو الذين يعانون من مضاعفات ثانوية للمرض.\n" +
            " الأشخاص ذوي أمراض الجهاز التنفسي المزمنة.\n" +
            " الأشخاص الذين يعانون من نقص  المناعة الخلقي أو المكتسب (عن طريق الأدوية: العلاج\n" +
            "الكيميائي المضاد للسّرطان، مثبّطات المناعة ، العلاج الحيوي و / أو العلاج بالكورتيكوستيرويد\n" +
            "بجرعة مثبطة للمناعة ، عدوى فيروس نقص المناعة البشرية غير المنضبط ، أو بعد عملية زرع\n" +
            "الأعضاء الصلبة أو الخلايا الجذعية المكونة للدّم ).\n" +
            " مرضى تليف الكبد في المرحلة ب عل الأقل.\n" +
            " المرأة الحامل في الثلث الثالث من الحمل.\n" +
            " الأشخاص الذين يعانون من السُّمنة المرضية (مؤشر كتلة الجسم IMC أكثر من 40 كغ / م).\n" +
            " (مصدر منظمة الصحة العالمية)\n" +
            "\""
    },{
        question: "هل الأشخاص ذو زمرة دموية <span dir='ltr'>O</span> محصنين بشكل أفضل؟\t",
        answer: "أظهرت دراسة صينية أن الأشخاص الذين ينتمون إلى الزمرة O لديهم خطر أقل بنسبة 33 ٪ للإصابة ، من ناحية أخرى ، فإنَّ الأشخاص من المجموعة A لديهم خطر إضافي بنسبة 20 ٪ للإصابة بالعدوى (Jiao Zhao 03/11/2020)."
    },{
        question: " كيف أحمي نفسي من مرض كوفيد-19\t",
        answer: "يجب عليك غسل الأيدي بالماء و الصّابون أو عن طريق محلول كحولي-مائي في كلّ وقت بعد كل استعمال" + "الإبقاء على مسافة أمان لا تقل على 1 متر بين الأشخاص خاصة الذين يعانون السّعال \n" +
            "تفادي لمس الأعين, الفم و الأنف\n" +
            "مسح الأنف بمناديل ورقية تستعمل لمرة وحيدة ثم ترمى\n" +
            "استخدم مرفقك عند السّعال و العطس\n" +
            "هذه التّعليمات تتغيّر سريعا بتطوّر الوضع في كل منطقة\n" +
            "لمزيد من المعلومات عن طريقة  منع انتشار مرض كوفيد-19  اضغط علي الرابط"
    },{
        question: "هل يجب استعمال الأفنعة لحماية نفسي من مرض كوفيد-19 \t",
        answer: "لا يجب ارتداء الأقنعة إلاّ إذا كنت تحمل أعراض مرض كوفيد-19 (خاصّة العطس و السّعال) أو إذا كنت سليما ولكن تعتني بشخص مصاب أو معرّض للمرض,ا لأقنعة مخصّصة للاستعمال الوحيد فإذا استعملته وأنت لا ينطبق عليك الشرطان السّابقان فهذا بعتبر تبذير \n" +
            "أحسن طريقة لحماية نفسك و مَن مِن حولك هي اتّباع جميع التّعليمات الوقائية المذكورو سابقا\n" +
            "لمزيد من المعلومات عن طريقة استعمال الأقنعة اضغط علي الرابط "
    },{
        question:"كيف يمكن احتواء وباء كوفيد-19  و منع انتشاره؟\t",
        answer: "الحجر المنزلي و الصّحي هو الطّريقة الأكثر فعالية لمواجهة الوباء. إذا نجحت الصين في تقليل عدد الحالات الجديدة لـكوفيد-19  إلى الصفر ، فذلك  بالحجز الشديد الذّي فرضته الدولة الصينية لمدة شهرين مصحوبًا بعملية:\n" +
            " الفحص الواسع لجميع الحالات المشتبه بها\n" +
            "تعقّب مرضي كوفيد-19 الإيجابيين و اتصالاتهم\n" +
            "اعتماد الحجر الصحي لأي شخص  إيجابي لمدّة 14 يوماَ\n" +
            "تعتقد منظمة الصحة العالمية أنه يجب الجمع بين الحجر  والفحص الجماعي للمرضى المشبوهين و الأشخاص الذين كانوا على تواصل معهم  من أجل القضاء على الوباء ومنع عودة ظهور حالات جديدة بمجرد رفع الاحتواء."
    }, {
        question: "هل الأشخاص ذو زمرة دموية O محصنين بشكل أفضل؟\t",
        answer: "أظهرت دراسة صينية أن الأشخاص الذين ينتمون إلى الزمرة O لديهم خطر أقل بنسبة 33 ٪ للإصابة ، من ناحية أخرى ، فإنَّ الأشخاص من المجموعة A لديهم خطر إضافي بنسبة 20 ٪ للإصابة بالعدوى (Jiao Zhao 03/11/2020)."
    }, {
        question: "هل يجب استعمال الأفنعة لحماية نفسي من مرض كوفيد-19 \t",
        answer: "لا يجب ارتداء الأقنعة إلاّ إذا كنت تحمل أعراض مرض كوفيد-19 (خاصّة العطس و السّعال) أو إذا كنت سليما ولكن تعتني بشخص مصاب أو معرّض للمرض,ا لأقنعة مخصّصة للاستعمال الوحيد فإذا استعملته وأنت لا ينطبق عليك الشرطان السّابقان فهذا بعتبر تبذير \n" +
            "أحسن طريقة لحماية نفسك و مَن مِن حولك هي اتّباع جميع التّعليمات الوقائية المذكورو سابقا\n" +
            "لمزيد من المعلومات عن طريقة استعمال الأقنعة اضغط علي الرابط "
    }
];

var frenchContent = [];
faqElementsArray.forEach(e => {
    question = e.getElementsByClassName("faq-question")[0].getElementsByTagName('h3')[0];
    text = e.getElementsByClassName("faq-text")[0].getElementsByTagName('p');
    p= text[0];
    var element = {question: question.innerHTML, answer: p.innerHTML};
    frenchContent.push(element);
});

var faqSwitch = document.getElementById("faq").getElementsByClassName("switch")[0];
var frenchCheck = document.getElementById("radio-i");
var arabicCheck = document.getElementById("radio-j");

faqSwitch.onclick = () => {
    if (frenchCheck.checked) {
        faqElementsArray.forEach(faqElement => {
            var i = faqElementsArray.indexOf(faqElement);
            faqQuestion = faqElement.getElementsByClassName("faq-question")[0];
            question = faqQuestion.getElementsByTagName('h3')[0];
            text = faqElement.getElementsByClassName("faq-text")[0].getElementsByTagName('p')[0];
            text.setAttribute("dir", "ltr")

            question.classList.toggle("text-arabic");
            question.classList.toggle("text-right");
            text.classList.toggle("text-arabic");
            text.classList.toggle("text-right");
            question.innerHTML = frenchContent[i].question;
            text.innerHTML = frenchContent[i].answer;
            faqElement.style.maxHeight = faqQuestion.offsetHeight + "px";
        });
    } else if (arabicCheck.checked) {
        faqElementsArray.forEach(faqElement => {

            var i = faqElementsArray.indexOf(faqElement);
            faqQuestion = faqElement.getElementsByClassName("faq-question")[0];
            question = faqQuestion.getElementsByTagName('h3')[0];
            text = faqElement.getElementsByClassName("faq-text")[0].getElementsByTagName('p')[0];
            text.setAttribute("dir", "rtl");

            question.classList.toggle("text-arabic");
            question.classList.toggle("text-right");
            text.classList.toggle("text-arabic");
            text.classList.toggle("text-right");
            question.innerHTML = arabicContent[i].question;
            text.innerHTML = arabicContent[i].answer;
            faqElement.style.maxHeight = faqQuestion.offsetHeight + "px";
        });
    }
};